n5/src/DataProcessors/ExpenseReport/ExpenseReport.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ExpenseReport</name>
</mdclass:DataProcessor>

n5/src/AccountingRegisters/General/General.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>General</name>
  <chartOfAccounts>ChartOfAccounts.General</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Currency</accountingFlag>
  </dimensions>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Quantitative</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Quantitative</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Accrual</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>CurrencyAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Currency</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Currency</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Operation</name>
    <type>
      <types>EnumRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>Dependency</name>
    <type>
      <types>DocumentRef.Payment</types>
      <types>DocumentRef.VendorInvoice</types>
      <types>DocumentRef.CustomsDeclaration</types>
      <types>DocumentRef.Production</types>
      <types>DocumentRef.Debts</types>
      <types>DocumentRef.AdjustDebts</types>
      <types>DocumentRef.AdjustVendorDebts</types>
      <types>DocumentRef.VendorPayment</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

n5/src/Documents/CashVoucher/CashVoucher.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CashVoucher</name>
  <attributes>
    <name>Accountant</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DefinedType.CashVoucherBase</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Director</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>Disconnected</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Location</name>
    <type>
      <types>CatalogRef.PaymentLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Reason</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Receiver</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
</mdclass:Document>

n5/src/Documents/VendorPayment/VendorPayment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>VendorPayment</name>
  <basedOn>Document.PurchaseOrder</basedOn>
  <basedOn>Document.VendorInvoice</basedOn>
  <registerRecords>AccumulationRegister.VendorDiscounts</registerRecords>
  <registerRecords>AccumulationRegister.VendorInvoiceDebts</registerRecords>
  <registerRecords>AccountingRegister.General</registerRecords>
  <registerRecords>AccumulationRegister.PurchaseOrderDebts</registerRecords>
  <registerRecords>AccumulationRegister.VendorDebts</registerRecords>
  <registerRecords>AccumulationRegister.VendorDiscountDebts</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>AdvanceAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Applied</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DocumentRef.VendorInvoice</types>
      <types>DocumentRef.PurchaseOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractFactor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpenseReport</name>
    <type>
      <types>DocumentRef.ExpenseReport</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeTax</name>
    <type>
      <types>EnumRef.IncomeCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeTaxAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeTaxAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeTaxRate</name>
    <type>
      <types>DefinedType.Percent</types>
    </type>
  </attributes>
  <attributes>
    <name>Location</name>
    <type>
      <types>CatalogRef.PaymentLocations</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Method</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentContent</name>
    <type>
      <types>DefinedType.PaymentContent</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>DefinedType.Reference</types>
    </type>
  </attributes>
  <attributes>
    <name>ReferenceDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Total</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>WithholdIncomeTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>Advance</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Contract</name>
      <type>
        <types>CatalogRef.Contracts</types>
      </type>
    </attributes>
    <attributes>
      <name>Debt</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Detail</name>
      <type>
        <types>DocumentRef.VendorRefund</types>
        <types>DocumentRef.VendorInvoice</types>
        <types>DocumentRef.VendorPayment</types>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.AdjustVendorDebts</types>
        <types>DocumentRef.VendorRefund</types>
        <types>DocumentRef.VendorInvoice</types>
        <types>DocumentRef.PurchaseOrder</types>
        <types>DocumentRef.CustomsDeclaration</types>
        <types>DocumentRef.VendorDebts</types>
      </type>
    </attributes>
    <attributes>
      <name>Option</name>
      <type>
        <types>CatalogRef.PaymentOptions</types>
      </type>
    </attributes>
    <attributes>
      <name>Pay</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Payment</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentKey</name>
      <type>
        <types>CatalogRef.PaymentKeys</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/Catalogs/Contacts/Contacts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Contacts</name>
  <basedOn>Catalog.Leads</basedOn>
  <owners>Catalog.Companies</owners>
  <owners>Catalog.Organizations</owners>
  <owners>Catalog.Warehouses</owners>
  <owners>Catalog.Leads</owners>
  <attributes>
    <name>AdditionalPhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessPhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Contact</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactType</name>
    <type>
      <types>CatalogRef.ContactTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Fax</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>HomePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Lead</name>
    <type>
      <types>CatalogRef.Leads</types>
    </type>
  </attributes>
  <attributes>
    <name>MobilePhone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Salutation</name>
    <type>
      <types>CatalogRef.Salutations</types>
    </type>
  </attributes>
  <attributes>
    <name>Skype</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Twitter</name>
    <type>
      <types>DefinedType.Twitter</types>
    </type>
  </attributes>
  <attributes>
    <name>Web</name>
    <type>
      <types>DefinedType.Web</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/DataProcessors/ExpenseReport/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Function Print ( Params, Env ) export
	
	Print.SetFooter ( Params.TabDoc );
	setPageSettings ( Params );
	getData ( Params, Env );
	putHeader ( Params, Env );
	putHeaderTable ( Params, Env );
	putTable ( Params, Env );
	return true;
	
EndFunction
 
Procedure setPageSettings ( Params )
	
	tabDoc = Params.TabDoc;
	tabDoc.PageOrientation = PageOrientation.Portrait;
	tabDoc.FitToPage = true;
	
EndProcedure 

Procedure getData ( Params, Env )
	
	SetPrivilegedMode ( true );
	sqlFields ( Env );
	getFields ( Params, Env );
	defineAmount ( Env );
	sqlCash ( Env );
	sqlItems ( Env );
	getTables ( Env );
	SetPrivilegedMode ( false );
	
EndProcedure

Procedure sqlFields ( Env )
	
	s = "
	|// @Fields
	|select Documents.Number as Number, Documents.Date as Date, Documents.Company.FullDescription as Company, Documents.Currency as CurrencyRef,
	|	Documents.Employee.Description as Employee, Documents.Currency.Description as Currency, Contacts.Name as Accountant,
	|	Documents.Employee as EmployeeRef,
	|	isnull ( LastReport.Date, dateadd ( Documents.Date, second, -1 ) ) as LastDate, 
	|	Documents.EmployeeAccount as EmployeeAccount, Documents.Rate as Rate, Documents.Factor as Factor, Constants.Currency as LocalCurrency,
	|	Documents.Company as CompanyRef, Documents.Description as Purpose
	|from Document.ExpenseReport as Documents
	|	//
	|	// Contacts
	|	//
	|	left join Catalog.Contacts as Contacts
	|	on Contacts.ContactType = value ( Catalog.ContactTypes.Accountant )
	|	and Contacts.Owner = Documents.Company
	|	//
	|	// Constants
	|	//
	|	join Constants as Constants
	|	on true
	|	// 
	|	// Last Expense Report
	|	//
	|	left join 
	|		( 
	|		select top 1 dateadd ( Documents.Date, second, 1 ) as Date, Documents.Ref as Ref
	|		from Document.ExpenseReport as Documents
	|			// 
	|			// Expense Report
	|			//
	|			join Document.ExpenseReport as Report
	|			on Report.Ref = &Ref
	|			and Report.Employee = Documents.Employee
	|			and Report.Currency = Documents.Currency
	|			and Report.Date > Documents.Date
	|		where Documents.Posted
	|		order by Documents.Date desc
	|		) as LastReport
	|	on true
	|where Documents.Ref = &Ref
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure getFields ( Params, Env )
	
	Env.Q.SetParameter ( "Ref", Params.Reference );
	SQL.Perform ( Env );
	
EndProcedure 

Procedure defineAmount ( Env )
	
	fields = Env.Fields;
	amount = "Total";
	vat = "VAT";
	if ( fields.Currency <> fields.LocalCurrency ) then
		rate = " * &Rate / &Factor";
		amount = amount + rate;
		vat = vat + rate;
	endif;
	Env.Insert ( "AmountField", "cast ( " + amount + " as Number ( 15, 2 ) )" );
	Env.Insert ( "VATField", "cast ( " + vat + " as Number ( 15, 2 ) )" );

EndProcedure 

Procedure sqlCash ( Env )
	
	s = "
	|// @Balance
	|select Balances.AmountBalance as Amount
	|from AccountingRegister.General.Balance ( dateadd ( &LastDate, second, 1 ),
	|Account = &Account, 
	|value ( ChartOfCharacteristicTypes.Dimensions.Employees ),
	|Company = &Company
	|and case when &Currency = &LocalCurrency then Currency is null else Currency = &Currency end
	|and ExtDimension1 = &Employee ) as Balances
	|;
	|// #Records
	|select General.Period as Period, General.Recorder as Recorder, General.AmountTurnoverDr as Amount,
	|	CashVouchers.Date as Date, CashVouchers.Number as Number
	|from AccountingRegister.General.Turnovers ( dateadd ( &LastDate, second, 1 ), &Date,
	|recorder,
	|Account = &Account, 
	|	value ( ChartOfCharacteristicTypes.Dimensions.Employees ),
	|	Company = &Company
	|	and case when &Currency = &LocalCurrency then Currency is null else Currency = &Currency end
	|	and ExtDimension1 = &Employee ) as General
	|	//
	|	// CashVoucher
	|	//
	|	join Document.CashVoucher as CashVouchers
	|	on CashVouchers.Base = General.Recorder
	|and not CashVouchers.DeletionMark
	|where 1 in ( select 1 from Document.ExpenseReport where Ref = &Ref and not SelectMoney )
	|union all
	|select Money.Document.Date, Money.Ref, Money.Document.Amount, Money.Document.Date,
	|	isnull ( Money.CashVoucher.Number, Money.Document.Number )
	|from Document.ExpenseReport.Money as Money
	|where Money.Ref = &Ref
	|and Money.Ref.SelectMoney
	|order by Period desc
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure sqlItems ( Env )
	
	amount = Env.AmountField;
	vat = Env.VATField;
	s = "
	|// Items
	|select Items.Item as Item, " + amount + " as Amount, Items.Account as Account, Items.Date as Date, 
	|	Items.DocumentSeries + Items.Number as Number,	Items.Amount as CurrencyAmount, " + vat + " as VAT
	|into Items
	|from Document.ExpenseReport.Items as Items
	|where Items.Ref = &Ref
	|union all
	|select Items.Item, " + amount + ", Items.Account, Items.Date, Items.DocumentSeries + Items.Number, Items.Amount, " + vat + "
	|from Document.ExpenseReport.Services as Items
	|where Items.Ref = &Ref
	|union all
	|select Items.Item, " + amount + ", Items.Item.Account, Items.Date, Items.DocumentSeries + Items.Number, Items.Amount, " + vat + " 
	|from Document.ExpenseReport.FixedAssets as Items
	|where Items.Ref = &Ref
	|union all
	|select Items.Item, " + amount + ", Items.Item.Account, Items.Date, Items.DocumentSeries + Items.Number, Items.Amount, " + vat + " 
	|from Document.ExpenseReport.IntangibleAssets as Items
	|where Items.Ref = &Ref
	|union all
	|select Items.Dim1, " + amount + ", Items.Account, Items.Date, Items.DocumentSeries + Items.Number, Items.Amount, " + vat + " 
	|from Document.ExpenseReport.Accounts as Items
	|where Items.Ref = &Ref
	|;
	|// Payments
	|select Documents.Vendor.FullDescription + case Documents.PaymentContent when """" then """" else "", "" + Documents.PaymentContent end as Item,
	|	Documents.VendorAccount.Code as Account,
	|	case when Documents.Reference = """" then Documents.Number else Documents.Reference end as Number,
	|	case when Documents.ReferenceDate = datetime ( 1, 1, 1 ) then Documents.Date else Documents.ReferenceDate end as Date,
	|	case when Documents.Currency = &LocalCurrency then Documents.Total else Documents.Total * Documents.Rate / Documents.Factor end as Amount,
	|	case when Documents.Currency = &Currency then 
	|			Documents.Total
	|		 else case when Documents.Currency = &LocalCurrency then 
	|				   		Documents.Total 
	|				   else Documents.Total * Documents.Rate / Documents.Factor 
	|			  end / &Rate * &Factor
	|	end as CurrencyAmount
	|into Payments
	|from Document.VendorPayment as Documents
	|where Documents.Posted
	|and Documents.ExpenseReport = &Ref
	|;
	|// #Items
	|select Items.Item.Description as Item, Items.Amount as Amount, Items.Account.Code as Account, Items.Date as Date, 
	|	Items.Number as Number, case when &Currency = &LocalCurrency then 0 else Items.CurrencyAmount end as CurrencyAmount,
	|	Items.VAT as VAT
	|from Items as Items
	|union all
	|select Items.Item, Items.Amount, Items.Account, Items.Date, Items.Number,
	|	case when &Currency = &LocalCurrency then 0 else Items.CurrencyAmount end, 0
	|from Payments as Items
	|order by Account, Date, Number, Item
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure getTables ( Env )
	
	fields = Env.Fields;
	q = Env.Q;
	q.SetParameter ( "Currency", fields.CurrencyRef );
	q.SetParameter ( "LocalCurrency", fields.LocalCurrency );
	q.SetParameter ( "Employee", fields.EmployeeRef );
	q.SetParameter ( "Company", fields.CompanyRef );
	q.SetParameter ( "Account", fields.EmployeeAccount );
	q.SetParameter ( "Rate", fields.Rate );
	q.SetParameter ( "Date", fields.Date );
	q.SetParameter ( "LastDate", fields.LastDate );
	q.SetParameter ( "Factor", fields.Factor );
	SQL.Prepare ( Env );
	Env.Insert ( "Data", q.ExecuteBatch () );
	SQL.Unload ( Env, Env.Data );
	
EndProcedure 

Procedure putHeader ( Params, Env )
	
	area = Env.T.GetArea ( "Header" );
	fields = Env.Fields;
	p = area.Parameters;
	p.Fill ( fields );
	date = fields.Date;
	p.Date = Format ( date, "DLF=D" );
	p.Year = Format ( date, "DF=yyyy" );
	fillCash ( Env, p );
	items = Env.Items;
	fillAccounts ( items, p );
	amount = items.Total ( "Amount" );
	p.Amount = amount;
	p.AmountInWords = Conversion.AmountToWords ( amount );
	intAmount = Int ( amount );
	p.AmountLei = Format ( intAmount, "NG=" );
	p.AmountBani = Format ( ( amount - intAmount ) * 100, "NZ=00" );
	p.DocumentsCount = getDocumentsCount ( items );
	difference = p.InitBalance + p.Income - amount;
	if ( difference > 0 ) then
		p.Balance = difference;
	else
		p.Overspending = -difference;
	endif;
	tabDoc = Params.TabDoc;
	tabDoc.Put ( area );
	Env.Insert ( "Amount", amount );
	
EndProcedure

Procedure fillCash ( Env, AreaParams ) 

	records = Env.Records;
	count = Min ( records.Count (), 3 );
	for i = 1 to count do
		row = records [ i - 1 ];
		AreaParams [ "Number" + i ] = row.Number;
		AreaParams [ "Date" + i ] = row.Date;
		AreaParams [ "Income" + i ] = row.Amount;
		AreaParams [ "Doc" + i ] = row.Recorder;
	enddo;
	AreaParams.InitBalance = Env.Balance.Amount;
	AreaParams.Income = records.Total ( "Amount" );

EndProcedure

Procedure fillAccounts ( Table, AreaParams ) 

	accounts = Table.Copy ();
	accounts.GroupBy ( "Account", "Amount" );
	count = accounts.Count ();
	for i = 1 to count do
		row = accounts [ i - 1 ];
		AreaParams [ "Account" + i ] = row.Account;
		AreaParams [ "Amount" + i ] = row.Amount;
	enddo;

EndProcedure

Function getDocumentsCount ( Table ) 

	documentsTable = Table.Copy ();
	documentsTable.GroupBy ( "Date, Number" );
	return documentsTable.Count ();

EndFunction

Procedure putHeaderTable ( Params, Env ) 

	fields = Env.Fields;
	t = Env.T;
	area = t.GetArea ( "Table" );
	if ( fields.CurrencyRef <> fields.LocalCurrency ) then
		area.Parameters.Currency = fields.Currency;
	endif;
	tabDoc = Params.TabDoc;
	tabDoc.Put ( area );
	Print.Repeat ( tabDoc, 4 );
	
EndProcedure

Procedure putTable ( Params, Env ) 

	t = Env.T;
	area = t.GetArea ( "Row" );
	p = area.Parameters;
	tabdoc = Params.TabDoc;
	table = Env.Items;
	for each row in table do
		p.Fill ( row );
		tabdoc.Put ( area );
	enddo;
	area = t.GetArea ( "Footer" );
	p = area.Parameters;
	p.Amount = Env.Amount;
	p.CurrencyAmount = table.Total ( "CurrencyAmount" );
	tabdoc.Put ( area );
	
EndProcedure

#endif
